# Objectives: 
- Review core `pandas` objects : `pandas.Series` and `pandas.DataFrame`

# `Pandas`
- python packages to wrangle and analyze tabular data
- built in on top of numpy
- core tool for data analysis in python

In [1]:
#import pandas with standard abbreviation
import pandas as pd
import numpy as np

# Series

A `panda.Series` :
- is one of the core data structures in `pandas`
- a 1 - dimmensional array of *indexed* data
- will be the columns of the `pandas.DataFrame`

# Creating a pandas series
several ways of creating
For now, we will create series using:

```
s = pd.Series(data, index = index)
```

-`data` = numpy array ( or a list of objects than can be converted to NumPy typess)
-`index` = a list of indices or same length as data

In [5]:
# ExL a pandas series from a numpy array

np.arange(3)
pd.Series(np.arange(3), index = ['a','b','c']) # parameter is optional parameter and if we want to see it, we need to specify

a    0
b    1
c    2
dtype: int64

In [6]:
#Create a series from a list of strings with defaultl index ( starting from 0 1 2 3)
pd.Series(['EDS 220','EDS 222','EDS 223', 'EDS 242'])

0    EDS 220
1    EDS 222
2    EDS 223
3    EDS 242
dtype: object

# Operation of Series
Arithmetic operations work on series and also on most NumPy functions:

Example:

In [9]:
#define a series
s = pd.Series( [98,73,65], index = ['Andrea','Beth','Carolina'])
print(s, '\n')

#divide each element in the series by 10:
print(s/10)

Andrea      98
Beth        73
Carolina    65
dtype: int64

Andrea      9.8
Beth        7.3
Carolina    6.5
dtype: float64

Example: Create a new series with `True`/`False` values indicating whether the elements in the series satisfy a condition or not

In [10]:
s>70

Andrea       True
Beth         True
Carolina    False
dtype: bool

This is simple but important, using conditions on series is key to select data from dataframes

## Attributes and Methods
 two examples about missing values
 
 - missing values in `pandas` are represented by `np.NaN` = not a number
 - `NaN` is a type of float in numpy

In [11]:
np.NaN

nan

In [12]:
type(np.NaN)

float

In [15]:
#series with NAs in it:
s = pd.Series([1,2, np.NaN, 4, np.NaN])
s

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

`hasnans` = attribute of pandas series, returns `True` if there are any NAs:

In [16]:
#check if series has NAs
s.hasnans

True

`isna()` = method of series, returns a series indiciating which elements are NAs:

In [17]:
s.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

`bool`: `True` or `False` are **boolean values**

#DataFrames
`pandas.DataFrame`:
- the most used object in `pandas`
- represenets tabular data ( think of a spreadsheet)
- each column is a `pandas.Series`

# Creating a `pandas.DataFrame`

* Many ways of creating a dataframe. lets see one.

Remember dictionaries? They are sets of key-value pairs:
```
{key 1:value 1,
key2: value 2
}

```
Think of a `pd.DataFrame` as a dictionary where:
- keys = column names
- values = column values

We can create a dataframe like this:

In [20]:
#initialize dictionary with columns' data

d = {'col_name_1': np.arange(3),
     'col_name_2': [3.1, 3.2 ,3.3]
    }
d

{'col_name_1': array([0, 1, 2]), 'col_name_2': [3.1, 3.2, 3.3]}

In [21]:
# create a dataframe 
df = pd.DataFrame(d)
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

# In place operations
Let's rename the data frame's columns

We can use a dataframe **method** called `rename`.
`rename` takes in as an input a dictionary:

```
{'col_1_old_name' : 'col_1_new_name',
'col_2_old_name' : 'col_2_new_name',
}

```

In [26]:
col_names = {'col_name_1': 'col_1',
             'col_name_2' : 'col_2'}

In [27]:
df.rename(columns = col_names)

   col_1  col_2
0      0    3.1
1      1    3.2
2      2    3.3

In [22]:
#take a look at our dataframe
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

Nothing changed!
`df.rename()` doesnt change the column in place, meaning it doesnt modify the object itself. Instead, it created a new object as an output

In [28]:
# Assign output back to dataframe
df= df.rename(columns = col_names)
df

   col_1  col_2
0      0    3.1
1      1    3.2
2      2    3.3